# -------------------------------------------------------------------------------------------------
# ----------------------------------小数点解决方案----------------------------------------------
# 1、可以训练的时候加入对meter类型的识别，同时在算法中实现针对不同类型的meter，在读数时根据数据自动加入小数点
# 2、写多几个算法，每个类型的表用专用的算法读，同样根据读数加入小数点，这样做可以不增加额外的训练
# 下面是一个小数点的demo
m_class = input("请选择表的类型，1为压力表，2为水表，请输入1或者2")
if m_class == "1":
    c = [4, 5, 6, 7]
    class_meter = "pressure meter"
    print("添加小数点前的读数为：", end="")
    for i in c:
        print(i, end="")
elif m_class == "2":
    c = [3, 4, 5, 7, 8, 9]
    class_meter = "water meter"
    print("添加小数点前的读数为：", end="")
    for i in c:
        print(i, end="")
else:
    print("输入错误，请重新输入")
print("")
print("添加小数点后的读数为：", end="")

if class_meter == "pressure meter":
    # 假如压力表读数保留3位小数，当读数数据大于4位的时候在第一位后面加小数点
    # 如果读数小于4位，则在第三位前面加0和小数点
    if len(c) >= 4:
        c.insert(1, '.')
    else:
        c.insert(0, 0)
        c.insert(1, '.')
elif class_meter == "water meter":
    # 假如是水表，只有最后一位数是小数，则直接在读数的最后一位数前加入小数点即可
    c.insert(-1, '.')
for i in c:
    print(i, end="")
# -----------------------------------------------------------------------------------------------
# 演示：假设已经知道表的读数和表的类比，现在向读数中加入小数点
